0.8249869695165777
Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_15 (Reshape)         (None, 33, 100, 1)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 1, 96, 16)         2656      
_________________________________________________________________
activation_78 (Activation)   (None, 1, 96, 16)         0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 1, 87, 32)         5152      
_________________________________________________________________
activation_79 (Activation)   (None, 1, 87, 32)         0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 2784)              0         
_________________________________________________________________
dense_50 (Dense)             (None, 50)                139250    
_________________________________________________________________
activation_80 (Activation)   (None, 50)                0         
_________________________________________________________________
dense_51 (Dense)             (None, 100)               5100      
_________________________________________________________________
activation_81 (Activation)   (None, 100)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 2)                 202       
_________________________________________________________________
activation_82 (Activation)   (None, 2)                 0         
=================================================================
Total params: 152,360
Trainable params: 152,360
Non-trainable params: 0
_________________________________________________________________
======================================================================

0.5000127121962624
Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_16 (Reshape)         (None, 33, 100, 1)        0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 1, 96, 16)         2656      
_________________________________________________________________
activation_83 (Activation)   (None, 1, 96, 16)         0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 1, 87, 64)         10304     
_________________________________________________________________
activation_84 (Activation)   (None, 1, 87, 64)         0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 5568)              0         
_________________________________________________________________
dense_53 (Dense)             (None, 50)                278450    
_________________________________________________________________
activation_85 (Activation)   (None, 50)                0         
_________________________________________________________________
dense_54 (Dense)             (None, 100)               5100      
_________________________________________________________________
activation_86 (Activation)   (None, 100)               0         
_________________________________________________________________
dense_55 (Dense)             (None, 2)                 202       
_________________________________________________________________
activation_87 (Activation)   (None, 2)                 0         
=================================================================
Total params: 296,712
Trainable params: 296,712
Non-trainable params: 0
_________________________________________________________________
======================================================================

0.8315438264700977
Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_17 (Reshape)         (None, 33, 100, 1)        0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 1, 96, 16)         2656      
_________________________________________________________________
activation_88 (Activation)   (None, 1, 96, 16)         0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 1, 87, 32)         5152      
_________________________________________________________________
activation_89 (Activation)   (None, 1, 87, 32)         0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 2784)              0         
_________________________________________________________________
dense_56 (Dense)             (None, 50)                139250    
_________________________________________________________________
activation_90 (Activation)   (None, 50)                0         
_________________________________________________________________
dense_57 (Dense)             (None, 100)               5100      
_________________________________________________________________
activation_91 (Activation)   (None, 100)               0         
_________________________________________________________________
activation_92 (Activation)   (None, 100)               0         
_________________________________________________________________
dense_58 (Dense)             (None, 200)               20200     
_________________________________________________________________
activation_93 (Activation)   (None, 200)               0         
_________________________________________________________________
dense_59 (Dense)             (None, 2)                 402       
_________________________________________________________________
activation_94 (Activation)   (None, 2)                 0         
=================================================================
Total params: 172,760
Trainable params: 172,760
Non-trainable params: 0
_________________________________________________________________
======================================================================

0.5
Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_18 (Reshape)         (None, 33, 100, 1)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 1, 96, 32)         5312      
_________________________________________________________________
activation_95 (Activation)   (None, 1, 96, 32)         0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 1, 87, 64)         20544     
_________________________________________________________________
activation_96 (Activation)   (None, 1, 87, 64)         0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 5568)              0         
_________________________________________________________________
dense_60 (Dense)             (None, 50)                278450    
_________________________________________________________________
activation_97 (Activation)   (None, 50)                0         
_________________________________________________________________
dense_61 (Dense)             (None, 100)               5100      
_________________________________________________________________
activation_98 (Activation)   (None, 100)               0         
_________________________________________________________________
activation_99 (Activation)   (None, 100)               0         
_________________________________________________________________
dense_62 (Dense)             (None, 200)               20200     
_________________________________________________________________
activation_100 (Activation)  (None, 200)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 2)                 402       
_________________________________________________________________
activation_101 (Activation)  (None, 2)                 0         
=================================================================
Total params: 330,008
Trainable params: 330,008
Non-trainable params: 0
_________________________________________________________________
======================================================================

