0.792804099590059
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 33, 100, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 1, 91, 16)         5296      
_________________________________________________________________
activation_1 (Activation)    (None, 1, 91, 16)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 77, 32)         7712      
_________________________________________________________________
activation_2 (Activation)    (None, 1, 77, 32)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2464)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 50)                123250    
_________________________________________________________________
activation_3 (Activation)    (None, 50)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               5100      
_________________________________________________________________
activation_4 (Activation)    (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 200)               20200     
_________________________________________________________________
activation_5 (Activation)    (None, 200)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 402       
_________________________________________________________________
activation_6 (Activation)    (None, 2)                 0         
=================================================================
Total params: 161,960
Trainable params: 161,960
Non-trainable params: 0
_________________________________________________________________
======================================================================

